# AlrtDialog

## Description
Procedure AlrtDialog displays an alert dialog to the user.

```pascal
PROCEDURE AlrtDialog(message : DYNARRAY[] of CHAR);
```

```python

def vs.AlrtDialog(message):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|DYNARRAY[] of CHAR|The alert message to be displayed.|

## Examples
```pascal
AlrtDialog('No objects are selected for this operation.');
```

## Version
Availability: from MiniCAD
## Category
* Dialogs - Predefined